# PostCommand Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..PostCommand Method
UIApplication Class See Also
---
Posts the command to the Revit message queue to be invoked when control returns from the current API context.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void PostCommand(
	RevitCommandId commandId
)
```

Visual Basic
---
```text
Public Sub PostCommand ( _
	commandId As RevitCommandId _
)
```

Visual C++
---
```text
public:
void PostCommand(
	RevitCommandId^ commandId
)
```

# ### Parameters
commandId
    Type: Autodesk.Revit.UI..::..RevitCommandId The command Id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when commandId is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | If the command cannot be posted. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If there is a command already been posted. |

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace